# Определяем базовый образ. Node 16 — это стабильная версия на момент написания,
# и она хорошо подходит для большинства проектов React.
FROM node:16-alpine

# Установите рабочий каталог в контейнере
WORKDIR /app

# Копируем файлы package.json и package-lock.json (или yarn.lock)
COPY package*.json ./

# Устанавливаем зависимости
RUN npm install

# Копируем оставшиеся файлы проекта
COPY . .

# Собираем статические файлы приложения
RUN npm run build

# Установливаем сервер для раздачи статических файлов, например serve
RUN npm install -g serve

# Запускаем сервер для раздачи собранных статических файлов
CMD ["serve", "-s", "build", "-l", "3000"]

# Открываем порт 3000
EXPOSE 3000